In [1]:
import pandas as pd
import numpy as np

dict1 = {
    "Train No." : [2451, 5632, 4896, 9874],
    "Speed" : [56,32,78,98],
    "City"  : ['Delhi', 'Mumbai', 'Coruscant', 'Jamnagar']
}

c1 = pd.DataFrame(dict1)
c1

   Train No.  Speed       City
0       2451     56      Delhi
1       5632     32     Mumbai
2       4896     78  Coruscant
3       9874     98   Jamnagar

In [2]:
c1.to_csv("Train_info.csv", index=False)

In [3]:
c1.head(1)  # Returns the first few rows

   Train No.  Speed   City
0       2451     56  Delhi

In [4]:
c1.tail(2)  # Returns the last few rows

   Train No.  Speed       City
2       4896     78  Coruscant
3       9874     98   Jamnagar

In [5]:
c1.describe()   # Returns min, max, std. deviation etc.

         Train No.      Speed
count     4.000000   4.000000
mean   5713.250000  66.000000
std    3089.153862  28.425341
min    2451.000000  32.000000
25%    4284.750000  50.000000
50%    5264.000000  67.000000
75%    6692.500000  83.000000
max    9874.000000  98.000000

In [6]:
td = pd.read_csv("Train_info.csv")
td

   Train No.  Speed       City
0       2451     56      Delhi
1       5632     32     Mumbai
2       4896     78  Coruscant
3       9874     98   Jamnagar

In [7]:
td['Speed'][1] = 85

C:\Users\DELL\AppData\Local\Temp\ipykernel_12404\2604854836.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  td['Speed'][1] = 85

In [8]:
td.to_csv("Updated.csv", index=False)